---
kind: other
id: Methods.T:Autodesk.Revit.DB.ComponentRepeaterIterator
source: html/a65906fc-29f7-e676-bb02-2e860f3db7e6.htm
---
# ComponentRepeaterIterator Methods

Returns the current repeater slot.